[Killed] StringLiteral
main/components/RequestTypes/RequestTypeTable.js:15:18
 export default function RequestTypeTable({
   requestTypes,
   currentUser,
-  testIdPrefix = "RequestTypeTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: RequestTypeTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
