[Killed] ObjectLiteral
src/main/utils/requestTypeUtils.js:13:10
 // Stryker restore all
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/requesttypes",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
+  return {};
 }
 
killedBy: RequestTypeTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
