[Killed] ObjectLiteral
main/pages/RequestType/RequestTypeEditPage.js:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/requesttypes?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/requesttypes`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/RequestType/RequestTypeEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (requestType) => ({
-    url: "/api/requesttypes",
-    method: "PUT",
-    params: {
-      id: requestType.id,
-    },
-    data: {
-      requestType: requestType.requestType,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (requestType) => {
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RequestType Updated - id: 17 requestType: Grad School Application"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/RequestType/RequestTypeEditPage.js:31:13
   const objectToAxiosPutParams = (requestType) => ({
     url: "/api/requesttypes",
     method: "PUT",
-    params: {
-      id: requestType.id,
-    },
+    params: {},
     data: {
       requestType: requestType.requestType,
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] ObjectLiteral
main/pages/RequestType/RequestTypeEditPage.js:34:11
     params: {
       id: requestType.id,
     },
-    data: {
-      requestType: requestType.requestType,
-    },
+    data: {},
   });
 
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requestType\":\"Grad School Application\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/RequestType/RequestTypeEditPage.js:39:38
     },
   });
 
-  const onSuccess = (requestType) => {
-    toast(
-      `RequestType Updated - id: ${requestType.id} requestType: ${requestType.requestType}`,
-    );
-  };
+  const onSuccess = (requestType) => {};
 
   const mutation = useBackendMutation(
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RequestType/RequestTypeEditPage.js:41:7
 
   const onSuccess = (requestType) => {
     toast(
-      `RequestType Updated - id: ${requestType.id} requestType: ${requestType.requestType}`,
+      ``,
     );
   };
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RequestType Updated - id: 17 requestType: Grad School Application"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/RequestType/RequestTypeEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Request Type</h1>
-        {requestType && (
-          <RequestTypeForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={requestType}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RequestType/RequestTypeEditPage.js:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Request Type</h1>
-        {requestType && (
-          <RequestTypeForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={requestType}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RequestTypeEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RequestTypeForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
