[Killed] BlockStatement
main/pages/RequestType/RequestTypeIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/requesttypes/create"
-          style={{ float: "right" }}
-        >
-          Create Request Type
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RequestTypeIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Request Type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/RequestType/RequestTypeIndexPage.js:30:27
         <Button
           variant="primary"
           href="/requesttypes/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Request Type
killedBy: RequestTypeIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
